Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྒྱུས་ལ་གསལ་ཞིང་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་གྱི་སློབ་དཔོན་དུ་བྱ་བར་མཁས་པའི་གཟུགས་ཆ་བྱད་རྣམ་པ་དུ་མ་དང་ལྡན་པ། དབྱིབས་དང་རྒྱན་རྣམ་པ་དུ་མ་དང་ལྡན་པ། ཡིད་དུ་འོང་བའི་ཚིག་མང་པོ་བརྗོད་པས། ཡིད་མི་བདེ་བའི་སེམས་ཅན་རབ་ཏུ་དགའ་བར་བྱེད་ཅིང་ཆོས་ཀྱི་ནོར་གྱིས་དབུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པ་དང་། སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་བདེ་བར་བྱ་བ་དང་། ལོག་པར་ལྟུང་བའི་སེམས་ཅན་རྣམས་མངོན་པར་གདོན་པ་དང་། ཐེག་པའི་གྲུ་ལ་ཉམ་ཉེས་སུ་གྱུར་པའི་སེམས་ཅན་རྣམས་དབུགས་དབྱུང་བ་དང་། འཇིགས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྐྱབ་པ་དང་། དགེ་བའི་རྩ་བའི་སྒྲ་ཀུན་ཏུ་གྲགས་པར་བྱ་བ་དང་། སྡིག་པ་ལས་བཟློག་པའི་སྒྲ་ཡོངས་སུ་བསྒྲག་པ་དང་། དགེ་བའི་ཆོས་ཡང་དག་པར་བླང་བ་ལ་སེམས་ཅན་གཟུང་བ་དང་། དོན་སྤྱོད་པ་ལ་སེམས་ཅན་དགོད་པ་དང་། དགའ་བའི་ཤུགས་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྙན་པར་སྨྲ་བའི་བསྡུ་བའི་དངོས་པོ་ཡོངས་སུ་བརྗོད་པ་དང་། འཇིག་རྟེན་ལ་དོན་མཐུན་པར་བསྒྲུབ་པ་སྟོན་པར་བྱེད་ཅིང་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་འདོང་བ་མཐོང་ངོ་། །
en: Sudhana saw Sāgara­dhvaja’s knees emanating and filling the ten direction with the forms of wise kṣatriyas, the forms of wise brahmins, the forms of those who were wise in worldly matters, the forms of those wise in various arts and crafts, the forms of those wise concerning human existence, the forms of those wise with the knowledge of carrying out both worldly and nonworldly practices, and the forms of those wise in honorable worldly conduct, taking on various forms, displaying the presence of many forms, speaking with pleasant words, making unhappy beings happy, caring for poor beings devoid of the wealth of the Dharma, making beings who are suffering happy, elevating beings who have fallen down, bringing relief to those who are shipwrecked, saving beings who are in fear, sounding out the words of all roots of merit, emitting the words of turning away from bad actions, bringing beings to the adoption of good qualities, establishing beings in beneficial conduct, engendering the power of joy, emitting pleasant words that are a method of gathering pupils, and showing consistency of words and actions to the world.

source: ལྟེ་བའི་དཀྱིལ་འཁོར་ནས་དྲང་སྲོང་མང་པོ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབྱིབས་སུ་འཁོད་པ། པགས་པ་དང་ཤུན་པའི་གོས་གྱོན་པ་རིལ་བ་ཐོགས་པ། གཟུགས་དང་ཆ་བྱད་དང་དབྱིབས་སྣ་ཚོགས་ཅན་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་དག་བྱུང་བས། སྟེང་གི་བར་སྣང་ལས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བརྗོད་པ་བྱེད་ཅིང་། ཆོས་ཀྱི་སྒྲ་ཡོངས་སུ་བསྒྲག་པ་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་བརྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡོངས་སུ་བསྟན་པ་དང་། ཚངས་པའི་སྤྱོད་པ་ཡོངས་སུ་བརྗོད་པ་དང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s navel, a multitude of ṛṣis manifesting as the bodies of all beings, wearing robes of antelope skins and bark, holding staffs and burl bowls, with various forms, features, and appearances, and having a peaceful deportment.

source: དབང་པོ་དབེན་པ་ལ་སེམས་ཅན་དགོང་པ་དང་། རང་བཞིན་མེད་པའི་དོན་རབ་ཏུ་བརྟག་པ་དང་། ཡེ་ཤེས་ཀྱི་དོན་ལ་འཇིག་རྟེན་རབ་ཏུ་དགོད་པ་དང་། འཇིག་རྟེན་གྱི་གཙུག་ལག་གི་རྣམ་པ་ཡོངས་སུ་བརྗོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་འབྱུང་བའི་ལམ་གྱི་ཚུལ་རབ་ཏུ་བསྟན་པ་དང་། མཐར་གྱིས་བྱ་བའི་ལས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་བྱེད་ཅིང་།
en: From up in the sky they were proclaiming the qualities of a buddha, speaking the word Dharma, uttering the word Buddha, teaching the bodhisattva Saṅgha, describing the path of celibacy, establishing beings in restraining the senses, expounding the meaning of the absence of intrinsic nature, establishing the world in the meaning of wisdom, guiding in the ways of worldly treatises, teaching the way of the path that gives rise to omniscience, and establishing beings in the succession of practices.

source: ཕྱོགས་བཅུ་བཀང་སྟེ་འདོང་བ་མཐོང་ངོ་། །རྩིབ་ལོགས་གཉིས་ནས། ཀླུའི་བུ་མོ་འཇིག་རྟེན་རྒྱུ་བ་ཐམས་ཅད་ཀྱི་གྲངས་དང་མཉམ་པ། ལུས་ཀྱི་དབྱིབས་བསམ་གྱིས་མི་ཁྱབ་པ་དུ་མ་དང་ལྡན་པ་བྱུང་སྟེ་ཀླུའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པ་དང་། སྤོས་ཀྱི་སྤྲིན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་བརྒྱན་པ་དང་། ཕྲེང་བའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་གྱིས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་རྣམ་པར་ཀླུབས་པ་དང་། རིན་པོ་ཆེའི་གདུགས་ཀྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་གྱིས། །ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཡོངས་སུ་ཁེབས་པར་བྱ་བ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་གྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ལྷའི་བ་དན་གྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ཕྱང་འཕྲུལ་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཆར་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་སྤྲིན་གྱི་ཆར་འབབ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་སེ་མོ་དོ་སྣ་ཚོགས་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པའི་བརྒྱན་དང་། རིན་པོ་ཆེའི་ཁྲི་ལ་སྐྱིལ་མོ་ཀྲུང་དུ་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པ་འབེབས་པའི་རྒྱན་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པའི་ལྷའི་བུ་མོ་མང་པོ་ཆོས་ཀྱི་གླུ་སྙན་པའི་སྒྲ་དབྱངས་ཀྱི་སྤྲིན་གྱི་ཆར་འབེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: Sudhana, the head merchant’s son, saw, issuing forth from the sides of Sāgara­dhvaja’s upper body, nāga maidens as numerous as all the worlds in existence, and in each instant of mind pervading the entire realm of phenomena.

source: རིན་པོ་ཆེའི་པད་མོ་ཟེ་བ་མཐོ་བ་མུ་ཏིག་གི་དྲ་བས་བརྒྱན་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་འབྲུའི་སྤྲིན་གྱི་ཆར་རྣམ་པར་འཐོར་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ཅོད་པན་གྱི་སྤྲིན་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་དང་། འོད་ཟེར་གྱི་སྤྲིན་མཐའ་ཡས་པའི་ཆར་འབེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ལྷའི་ལུས་ཀྱི་སྤྲིན་གྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྷའི་བ་དན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ལྷའི་བུ་མོ་མང་པོའི་ལུས་ཀྱི་སྤྲིན་ཐལ་མོ་སྦྱར་ཏེ། གསེར་གྱི་མེ་ཏོག་སྙིམ་པས་འདོར་བ། དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཏན་དང་། ལེགས་པ་ཐམས་ཅད་དུ་བསྟོད་པའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་འབྱིན་ཅིང་ཆར་འབེབས་པ།
en: They were appearing as inconceivably numerous bodies, manifesting an inconceivable number of nāga miracles, establishing in the sky an inconceivable adornment of clouds of scented water, adorning the sky with the inconceivable adornment of clouds of flowers, arraying the entire sky with the inconceivable adornment of clouds of garlands, and covering the entire realm of phenomena with the inconceivable adornment of clouds of precious parasols; with the inconceivable adornment of clouds of precious banners; with the inconceivable adornment of clouds of precious streamers; with the inconceivable adornment of the rain from clouds of various pendant ornaments; with the inconceivable adornment of the rain from clouds of excellent precious jewels; with the inconceivable adornment of the rain from clouds of various precious necklaces and flowers; with the inconceivable adornment of the rain from clouds of the Dharma of buddhas and bodhisattvas seated cross-legged on precious thrones; with the inconceivable adornment of the rain from clouds of the sound of the Dharma songs of a multitude of apsarases wearing a variety of divine, precious jewelry; with the inconceivable adornment of the scattering rain from clouds of precious lotuses adorned with strings of pearls with tall anthers and pollen of all kings of jewels; with the inconceivable adornment of the rain from clouds of precious crowns adorned with all precious jewels and clouds of endless light rays; with the inconceivable adornment of the rain from clouds of the bodies of devas adorned by flowers, garlands, parasols, banners, and streamers; and with the inconceivable adornment of the rain and thunder from clouds of the bodies of multitudes of apsarases scattering golden flowers from between their hands conjoined in homage and praising all the qualities and excellences of the tathāgatas.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་རློབ་ཅིང་། སྤོས་ཀྱི་ཕུང་པོའི་སྤྲིན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་ཏུ་འདུག་པ་དང་། བདུག་སྤོས་ཀྱི་ན་བུན་དང་སྤྲིན་ཤིན་ཏུ་རྒྱ་ཆེ་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་མངོན་པར་ཁེབས་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རབ་ཏུ་བརྒྱན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་མཆོད་པས་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མཐོང་ཀའི་དཔལ་གྱི་བེའུ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: Vast clouds and mists of the best incense stationed in the sky, together with the clouds of heaps of scented waters with the colors of all jewels, covered the assemblies of the followers of all tathāgatas, adorned the entire extent of world realms, brought happiness to all beings, and made offerings to all the buddhas.

source: ལྷ་མ་ཡིན་གྱི་སྒྱུས་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་སྟོན་ཅིང་ཆུ་འཛིན་ཆེན་པོ་ཡོངས་སུ་བསྐྱམ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྟོང་རབ་ཏུ་བསྐྱོད་པ་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་ཐམས་ཅད་འཐབ་པར་བྱ་བ་དང་། ལྷའི་གནས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་པ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་གནན་པ་དང་། བདུད་ཀྱི་སྡེ་ཐམས་ཅད་རབ་ཏུ་གདུལ་བ་དང་། ང་རྒྱལ་དང་རློམ་པ་དང་དྲེགས་པ་ཐམས་ཅད་རབ་ཏུ་གཞོམ་པ་དང་། གནོད་པར་སེམས་པའི་སེམས་བཟློག་ཅིང་དགའ་བར་བྱ་བ་དང་། འཐོ་འཚམ་པའི་སེམས་ཕྱིར་བཟློག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱིས་མི་དགེ་བའི་ཆོས་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། ཉོན་མོངས་པའི་རི་རྣམ་པར་གཏོར་བ་དང་། ཉོན་མོངས་པའི་ཐབ་མོ་ཤིན་ཏུ་ཞི་བར་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་སྒྱུས་རྣམ་པར་འཕྲུལ་པ་དང་། རྣམ་པར་རྩེ་བ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་སྐྱོ་བར་བྱ་བ་དང་། སྡིག་པ་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། འཁོར་བས་འཇིགས་པར་བྱ་བ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ནས་གྱེན་དུ་བསྐྱོད་དེ་གནས་མེད་པ་ལ་རབ་ཏུ་གནས་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་རབ་ཏུ་གཟུང་བ་དང་།
en: Sudhana saw, issuing forth from the śrīvatsa on Sāgara­dhvaja’s chest, asura lords as numerous as the atoms in countless buddha realms, in each instant of mind pervading the realm of phenomena and manifesting networks of inconceivable, miraculous asura conjurations; agitating oceans; causing a hundred thousand world realms to tremble; dashing together all the sovereign lords of mountains; causing all the residences of the devas to tremble; overwhelming all the domains of māras; crushing all the armies of māras; destroying all pride, conceit, and arrogance in the world; repelling malicious motivations and then bringing happiness; banishing motivations toward violence; bringing the bad qualities of beings to an end; disintegrating the mountains of the kleśas; bringing the battle with the kleśas to an end; disturbing beings through enjoying manifesting various asura conjurations; causing them to shrink from bad actions; causing them to be terrified of saṃsāra; causing them to depart from the states of existence and settle in being without an abode; establishing beings in the aspiration to enlightenment; causing them to purify the bodhisattva conduct of the bodhisattvas; establishing them in the perfections of the bodhisattvas; causing them to enter the bodhisattva bhūmis; giving rise to the illumination of the way of the Buddhadharma of the bodhisattvas; and establishing beings in the various ways of the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚུལ་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཆོས་ཀྱི་ཚུལ་རྣམ་པར་དགོད་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པར་བྱེད་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །རྒྱབ་ཀྱི་གཞུང་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་མང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་བདག་ཏུ་མངོན་པར་ཞེན་པ་རྣམས་ལ་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་ཡོངས་སུ་བརྗོད་པ་བྱེད་ཅིང་། རྟག་པར་མངོན་པར་ཞེན་པ་རྣམས་ལ་འདུ་བྱེད་ཐམས་ཅད་མྱི་རྟག་པར་ཡོངས་སུ་བསྟན་པ་དང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s back, a multitude of śrāvakas and pratyeka­buddhas as numerous as the atoms in countless buddha realms and pervading the realm of phenomena.

source: འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཅན་རྣམས་ལ་མྱི་སྡུག་པ་དང་། ཞེ་སྡང་གི་སྤྱོད་པ་ཅན་རྣམས་ལ་བྱམས་པ་དང་། གཏི་མུག་གི་སྤྱོད་པ་ཅན་རྣམས་ལ་རྐྱེན་ལས་བྱུང་བའི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བརྗོད་པ་དང་། ཆ་མཉམ་པའི་སྤྱོད་པ་ཅན་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚུལ་མངོན་པར་བསྟན་པ་དང་། ཡུལ་ལ་མངོན་པར་དགའ་བ་རྣམས་ལ་གནས་མེད་པ་རབ་ཏུ་བརྗོད་པ་དང་། ཞི་བ་ལ་གནས་སུ་སེམས་པ་རྣམས་ལ་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་སྤྲོ་བ་བསྐྱེད་པ་དང་། ཕྱོགས་ཀྱི་རྒྱུད་དང་སྒོ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་རྒྱུད་དང་། སྒོ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྗོད་པར་བྱེད་ཅིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །ཕྲག་པའི་ལྷུན་གཉིས་ལས་གནོད་སྦྱིན་དང་།
en: The śrāvakas and pratyeka­buddhas were teaching the absence of a self and the absence of a being to those beings who were to be guided by them and had attachment to a self; they were teaching the impermanence of the composite to those who were attached to permanence, ugliness to those who had the conduct of desire, love to those who had the conduct of anger, and dependent origination to those who had the conduct of ignorance; and they were teaching the way of the Dharma that has the range of wisdom to those who had equal amounts of those conducts, teaching the absence of a basis to those who delighted in the range of sensory perceptions, inspiring higher aspirations in those who intended to dwell in peace, and illuminating the gateways to all directions and all the gateways of the ocean of ways in the Dharma.

source: སྲིན་པོའི་དབང་པོ་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་ཞིང་ལུས་མི་སྡུག་པ་ཁ་དོག་དང་ཆུ་ཞེང་སྣ་ཚོགས་ཅན་སྤྱོད་ལམ་གྱི་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ། བཞོན་པ་སྣ་ཚོགས་ལ་ཞོན་པ།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s shoulder blades, yakṣa and rākṣasa lords as numerous as the atoms in countless buddha realms, having various forms, peculiar bodies of various colors and widths, various kinds of mendicancy, and various kinds of mounts.

source: འཁོར་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ། སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ། འོད་སྣ་ཚོགས་ཀྱིས་སྣང་བར་བྱ་བ་ལ་བརྩོན་པ། དབྱངས་སྣ་ཚོགས་རབ་ཏུ་སྒྲོག་པ། སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཐབས་མངོན་པར་བསྒྲུབ་པ་སྣ་ཚོགས་མ་འདྲེས་པས་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་གྱི་ནམ་མཁའ་རྒྱས་པར་འགེངས་ཤིང་དགེ་བའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་། འཕགས་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་།
en: They were accompanied by various kinds of entourages, spreading throughout the realm of phenomena, and they were engaging in protecting the realm of beings, engaging in emitting different kinds of light, singing various songs, and filling the directions and intermediate directions of space with the accomplishment of various distinct methods as numerous as the atoms in countless buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་དང་། ལག་ན་རྡོ་རྗེའི་ལས་ཀྱིས་ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་དང་། སེམས་ཅན་ལོག་པར་ལྟུང་བ་རྣམས་ཀྱི་ངན་སོང་གི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་།
en: They did this so as to guard all good conduct, so as to guard all the assemblies of the āryas, so as to care for all bodhisattvas, so as to protect through the activity of Vajrapāṇi all those who are perfectly practicing the perfect way, so as to render various services to and make various offerings to all the buddhas, and so as to bring fallen beings back from the pathway to the lower existences.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ནད་དང་། གནོད་པ་དང་འཇིགས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའི་དོན་དུ་བརྩོན་པ། སེམས་ཅན་གྱི་དོན་བྱ་བས་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ་རྣམས་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། ཕས་ཀྱི་རྒོལ་བའི་འཁོར་ཚར་གཅོད་པར་བྱེད་ཅིང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་བྱེད་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མདུན་གྱི་ལྟོ་ནས་མྱི་འམ་ཅིའི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མིའམ་ཅིའི་དབང་པོའི་བུ་མོའི་འཁོར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཅན་དང་། དྲི་ཟའི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད། དྲི་ཟའི་དབང་པོའི་བུ་མོའི་འཁོར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཅན་དག་བྱུང་ནས། ལྷའི་རོལ་མོ་བརྒྱ་སྟོང་གྲངས་མེད་པའི་སྒྲ་སྙན་པ་དང་། གླུའི་དབྱངས་ཀྱིས་ཆོས་ཀྱི་རང་བཞིན་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་བསྟོད་པ་བརྗོད་པ་བྱེད་ཅིང་།
en: They were engaged in bringing all illness, harm, and danger in all worlds to an end, were engaged in protecting in the world all activities beneficial to beings, were causing the wheel of gathering merit and wisdom to be completed, were causing the wheel of the Dharma to be turned, and were destroying the wheel of the adversaries.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བསྔགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བརྗོད་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྒོ་ཐམས་ཅད་ལ་མངོན་པར་བསྟོད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་སྒོ་ཐམས་ཅད་དུ་འཇུག་པ་དང་། རྣམ་པར་འཕྲུལ་པའི་སྒོ་ཐམས་ཅད་ལ་མངོན་པར་སྤྲོ་བར་བྱ་བ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱིས་བསྟན་པའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་དང་། སེམས་ཅན་གྱི་སྒོ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་མངོན་པར་བསྟན་པར་བྱ་བ་དང་། སྒྲིབ་པའི་སྒོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱེད་པ་བྱེད་ཅིང་། ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །ཁའི་སྒོ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རིན་པོ་ཆེ་བདུན་དང་ལྡན་ཞིང་སྟོབས་ཀྱི་ཡན་ལག་བཞིའི་ཚོགས་ཀྱི་འཁོར་དང་ལྡན་པ་བྱུང་ནས།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s stomach, kinnara lords as numerous as the atoms in countless buddha realms, accompanied by entourages of countless hundreds of thousands of kinnara maidens and gandharva lords as numerous as the atoms in countless buddha realms, accompanied by entourages of countless hundreds of thousands of gandharva maidens, spreading throughout the realm of phenomena, with the sounds of countless hundreds of thousands of musical instruments and the singing of songs that had the nature of the Dharma, eulogizing the aspiration to enlightenment, elucidating bodhisattva conduct, praising all the gateways to complete buddhahood, causing entry into all the gateways of the Dharma, causing aspiration for all the gateways to miracles, elucidating all the gateways to nirvāṇa, causing the acquisition of all the gateways to the Buddha’s teaching, causing joy for all the gateways to beings, causing the purification of all buddha realms, causing the elucidation of all the Dharma gateways, causing all the gateways to obscuration to be repelled, and causing all the gateways to the roots of merit to be developed.

source: སྦྱིན་པ་ཆེན་པོའི་འོད་ཟེར་གྱི་རྒྱན་རབ་ཏུ་འགྱེད་ཅིང་རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་ཚོགས་ཐམས་ཅད་སྦྱིན་པ་དང་། དབུལ་པོ་རྣམས་ནོར་དང་ལྡན་པར་བྱ་བ་དང་། སྲོག་གཅོད་པ་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། བྱམས་པའི་སེམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། རབ་ཏུ་དབྲལ་བ་དང་། རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་གཏང་བ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་ལས་རྣམ་པར་བཟློག་པ་དང་། ཚངས་པའི་སྤྱོད་པ་ལ་རབ་ཏུ་དགོད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་ལས་རྣམ་པར་བཟློག་པ་དང་། བསླུ་བ་མྱེད་པ་ལ་གཞོལ་བར་རབ་ཏུ་དགོད་པ་དང་། ཕྲ་མའི་ཚིག་ལས་རྣམ་པར་བཟློག་པ་དང་། གཞན་འདུམ་པར་བརྩོན་པའི་ཚིག་རབ་ཏུ་བརྗོད་པ་དང་། ཞེ་གཅོད་པའི་ཚིག་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། འཇམ་ཞིང་ཡིད་དུ་འོང་བའི་ཚིག་རབ་ཏུ་བརྗོད་པ་དང་། གནོད་པའི་ཆོས་དང་ལྡན་པའི་བྱུང་རྒྱལ་དུ་སྨྲ་བ་ལས་སེམས་ཅན་རྣམ་པར་བཟློག་པ་དང་། དོན་ཟབ་མོའི་ཚིག་རབ་ཏུ་དབྱེ་བ་གདོན་མི་ཟ་བ་ལ་ཡང་དག་པར་དགོད་པ་དང་། ངག་གི་ཉེས་པ་ཐམས་ཅད་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། སྙིང་རྗེ་དང་ལྡན་པའི་ཚིག་རབ་ཏུ་བརྗོད་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་སྙིང་གི་དྲི་མ་ཡོངས་སུ་སེལ་ཅིང་འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་ལ་བརྩོན་པར་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། ཆགས་སེམས་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། གཞན་གྱི་སེམས་ཀྱི་རྒྱུད་དགའ་བར་བྱེད་པ་ལ་རབ་ཏུ་དགོད་པ་དང་། ལྟ་བའི་དྲ་བ་ཐམས་ཅད་ལས་འཇིག་རྟེན་རབ་ཏུ་གདོན་པ་དང་། ཡིད་གཉིས་ཀྱི་ར་བ་ཐམས་ཅད་རྣམ་པར་གཏོར་བ་དང་། ཐེ་ཙོམ་གྱི་སྤོ་ཐམས་ཅད་ཡང་རབ་ཏུ་གཞོམ་པ་དང་། ནེམ་ནུར་དང་སོམ་ཉིའི་རབ་རིབ་ཡོངས་སུ་བསྩལ་བ་དང་། ཆོས་རྣམ་པར་དབྱེ་བའི་འཇིག་རྟེན་དུ་རབ་ཏུ་དབྱེ་བ་དང་། རྐྱེན་ལས་བྱུང་བ་རབ་ཏུ་བརྗོད་པ་དང་། རང་བཞིན་གྱིས་བདེན་པའི་ཚུལ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སྒྲིབ་པ་མེད་པའི་ཚུལ་ལ་གཟུང་བ་དང་། སངས་རྒྱས་ཀྱི་དོན་གྱི་ཚུལ་སྣ་ཚོགས་བརྗོད་པ་བྱེད་ཅིང་། ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མིག་གཉིས་ནས་ཉི་མའི་དཀྱིལ་འཁོར་བརྒྱ་སྟོང་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐམས་ཅད་ཡོངས་སུ་སྣང་བར་བྱེད་ཅིང་འཇིག་རྟེན་གྱི་མུན་པ་ཆེན་པོ་སེལ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་གཏི་མུག་གི་རབ་རིབ་སེལ་བ་དང་། གྲང་བའི་སེམས་ཅན་དམྱལ་བ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ཀྱི་གྲང་བའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། སའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཁ་དོག་དཀར་པོ་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་བཻ་ཌཱུརྱའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། བཻ་ཌཱུརྱའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་དངུལ་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། དངུལ་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་གསེར་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཤེལ་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་མུ་ཏིག་དམར་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། ཨ་སྨྲ་གརྦྷའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་གསེར་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s mouth, cakravartins as numerous as the atoms in countless buddha realms, possessing an entourage of the seven jewels and the four divisions of the army; spreading throughout the ten directions of the realm of phenomena and radiating a display of the light rays of great generosity; emitting a profusion of all precious materials; distributing a profusion of all precious jewels; making the poor wealthy; turning the world away from killing; establishing beings in a loving motivation; dissuading them from taking what has not been given; bestowing on them a quintillion maidens adorned with jewelry; deterring them from sexual misconduct; establishing them in celibacy; turning them away from lying; exhorting them to avoid deception; turning them away from slanderous words; inspiring them toward creating harmony between others; turning the world away from harsh speech; inspiring them to speak pleasantly and gently; turning beings away from worthless, careless, meaningless speech and directing them to speech with definitive categories of profound words; turning the world away from all bad speech and inspiring it to speak with words of compassion; removing the heart’s stains within the world; directing beings to contentment and few needs; turning the world away from malice; directing it to bring happiness to the minds of others; raising the world up out of the net of wrong views; demolishing the walls of all doubt; causing the mountain peak of all uncertainty to tumble down; clearing away the darkness of indecisive thinking; separating for the world the categories of phenomena; describing dependent origination; guiding beings into the way to the true nature; making them turn away from obscurations; causing them to enter the way free of obscuration; and inspiring them on the way to the goal of buddhahood.
